#include "wjtwl_lib.h"
#include "elp.h"
#include "wjtwl_math.h"

typedef struct
{
	double D;
	double M;
	double Mp;
	double F;
	double eiA;
	double erA;
}MOON_ECLIPTIC_LONGITUDE_COEFF;

/*
	月球黄经周期项(ΣI)及距离(Σr).
	黄经单位:0.000001度,距离单位:0.001千米.
--------------------------------------------------
  角度的组合系数  ΣI的各项振幅A  Σr的各项振幅A
  D  M  M' F        (正弦振幅)       (余弦振幅)
--------------------------------------------------
*/
const MOON_ECLIPTIC_LONGITUDE_COEFF Moon_longitude[60] =
{
	{ 0,  0,  1,  0, 6288744, -20905355 },
	{ 2,  0, -1,  0, 1274027,  -3699111 },
	{ 2,  0,  0,  0,  658314,  -2955968 },
	{ 0,  0,  2,  0,  213618,   -569925 },
	{ 0,  1,  0,  0, -185116,     48888 },
	{ 0,  0,  0,  2, -114332,     -3149 },
	{ 2,  0, -2,  0,   58793,    246158 },
	{ 2, -1, -1,  0,   57066,   -152138 },
	{ 2,  0,  1,  0,   53322,   -170733 },
	{ 2, -1,  0,  0,   45758,   -204586 },
	{ 0,  1, -1,  0,  -40923,   -129620 },
	{ 1,  0,  0,  0,  -34720,    108743 },
	{ 0,  1,  1,  0,  -30383,    104755 },
	{ 2,  0,  0, -2,   15327,     10321 },
	{ 0,  0,  1,  2,  -12528,         0 },
	{ 0,  0,  1, -2,   10980,     79661 },
	{ 4,  0, -1,  0,   10675,    -34782 },
	{ 0,  0,  3,  0,   10034,    -23210 },
	{ 4,  0, -2,  0,    8548,    -21636 },
	{ 2,  1, -1,  0,   -7888,     24208 },
	{ 2,  1,  0,  0,   -6766,     30824 },
	{ 1,  0, -1,  0,   -5163,     -8379 },
	{ 1,  1,  0,  0,    4987,    -16675 },
	{ 2, -1,  1,  0,    4036,    -12831 },
	{ 2,  0,  2,  0,    3994,    -10445 },
	{ 4,  0,  0,  0,    3861,    -11650 },
	{ 2,  0, -3,  0,    3665,     14403 },
	{ 0,  1, -2,  0,   -2689,     -7003 },
	{ 2,  0, -1,  2,   -2602,         0 },
	{ 2, -1, -2,  0,    2390,     10056 },
	{ 1,  0,  1,  0,   -2348,      6322 },
	{ 2, -2,  0,  0,    2236,     -9884 },
	{ 0,  1,  2,  0,   -2120,      5751 },
	{ 0,  2,  0,  0,   -2069,         0 },
	{ 2, -2, -1,  0,    2048,     -4950 },
	{ 2,  0,  1, -2,   -1773,      4130 },
	{ 2,  0,  0,  2,   -1595,         0 },
	{ 4, -1, -1,  0,    1215,     -3958 },
	{ 0,  0,  2,  2,   -1110,         0 },
	{ 3,  0, -1,  0,    -892,      3258 },
	{ 2,  1,  1,  0,    -810,      2616 },
	{ 4, -1, -2,  0,     759,     -1897 },
	{ 0,  2, -1,  0,    -713,     -2117 },
	{ 2,  2, -1,  0,    -700,      2354 },
	{ 2,  1, -2,  0,     691,         0 },
	{ 2, -1,  0, -2,     596,         0 },
	{ 4,  0,  1,  0,     549,     -1423 },
	{ 0,  0,  4,  0,     537,     -1117 },
	{ 4, -1,  0,  0,     520,     -1571 },
	{ 1,  0, -2,  0,    -487,     -1739 },
	{ 2,  1,  0, -2,    -399,         0 },
	{ 0,  0,  2, -2,    -381,     -4421 },
	{ 1,  1,  1,  0,     351,         0 },
	{ 3,  0, -2,  0,    -340,         0 },
	{ 4,  0, -3,  0,     330,         0 },
	{ 2, -1,  2,  0,     327,         0 },
	{ 0,  2,  1,  0,    -323,      1165 },
	{ 1,  1, -1,  0,     299,         0 },
	{ 2,  0,  3,  0,     294,         0 },
	{ 2,  0, -1, -2,       0,      8752 }
};


void GetMoonEclipticParameter(double dt, double* Lp, double* D, double* M, double* Mp, double* F, double* E)
{
	double T = dt;/*T是从J2000起算的儒略世纪数*/
	double T2 = T * T;
	double T3 = T2 * T;
	double T4 = T3 * T;

	/*月球平黄经*/
	*Lp = 218.3164591 + 481267.88134236 * T - 0.0013268 * T2 + T3 / 538841.0 - T4 / 65194000.0;
	*Lp = Mod360Degree(*Lp);

	/*月日距角*/
	*D = 297.8502042 + 445267.1115168 * T - 0.0016300 * T2 + T3 / 545868.0 - T4 / 113065000.0;
	*D = Mod360Degree(*D);

	/*太阳平近点角*/
	*M = 357.5291092 + 35999.0502909 * T - 0.0001536 * T2 + T3 / 24490000.0;
	*M = Mod360Degree(*M);

	/*月亮平近点角*/
	*Mp = 134.9634114 + 477198.8676313 * T + 0.0089970 * T2 + T3 / 69699.0 - T4 / 14712000.0;
	*Mp = Mod360Degree(*Mp);

	/*月球经度参数(到升交点的平角距离)*/
	*F = 93.2720993 + 483202.0175273 * T - 0.0034029 * T2 - T3 / 3526000.0 + T4 / 863310000.0;
	*F = Mod360Degree(*F);

	*E = 1 - 0.002516 * T - 0.0000074 * T2;
}

/*计算月球地心黄经周期项的和*/
double CalcMoonECLongitudePeriodic(double D, double M, double Mp, double F, double E)
{
	double EI = 0.0;

	for (int i = 0; i < COUNT_OF(Moon_longitude); i++)
	{
		double sita = Moon_longitude[i].D * D + Moon_longitude[i].M * M + Moon_longitude[i].Mp * Mp + Moon_longitude[i].F * F;
		sita = DegreeToRadian(sita);
		EI += (Moon_longitude[i].eiA * sin(sita) * pow(E, fabs(Moon_longitude[i].M)));
	}

	return EI;
}

/*计算金星摄动,木星摄动以及地球扁率摄动对月球地心黄经的影响,dt 是儒略世纪数，Lp和F单位是度*/
double CalcMoonLongitudePerturbation(double dt, double Lp, double F)
{
	double T = dt; /*T是从J2000起算的儒略世纪数*/
	double A1 = 119.75 + 131.849 * T;
	double A2 = 53.09 + 479264.290 * T;

	A1 = Mod360Degree(A1);
	A2 = Mod360Degree(A2);

	double result = 3958.0 * sin(DegreeToRadian(A1));
	result += (1962.0 * sin(DegreeToRadian(Lp - F)));
	result += (318.0 * sin(DegreeToRadian(A2)));

	return result;
}